iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3X8E/targetInit/SAM3X8Esfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRE0:1;
      uint64_t OVRE1:1;
      uint64_t OVRE2:1;
      uint64_t OVRE3:1;
      uint64_t OVRE4:1;
      uint64_t OVRE5:1;
      uint64_t OVRE6:1;
      uint64_t OVRE7:1;
      uint64_t OVRE8:1;
      uint64_t OVRE9:1;
      uint64_t OVRE10:1;
      uint64_t OVRE11:1;
      uint64_t OVRE12:1;
      uint64_t OVRE13:1;
      uint64_t OVRE14:1;
      uint64_t OVRE15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_OVER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPMODE:2;
      uint64_t reservedSpace0:2;
      uint64_t CMPSEL:4;
      uint64_t reservedSpace1:1;
      uint64_t CMPALL:1;
      uint64_t reservedSpace2:2;
      uint64_t CMPFILTER:2;
      uint64_t reservedSpace3:10;
      uint64_t TAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_EMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOWTHRES:12;
      uint64_t reservedSpace0:4;
      uint64_t HIGHTHRES:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CWR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GAIN0:2;
      uint64_t GAIN1:2;
      uint64_t GAIN2:2;
      uint64_t GAIN3:2;
      uint64_t GAIN4:2;
      uint64_t GAIN5:2;
      uint64_t GAIN6:2;
      uint64_t GAIN7:2;
      uint64_t GAIN8:2;
      uint64_t GAIN9:2;
      uint64_t GAIN10:2;
      uint64_t GAIN11:2;
      uint64_t GAIN12:2;
      uint64_t GAIN13:2;
      uint64_t GAIN14:2;
      uint64_t GAIN15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFF0:1;
      uint64_t OFF1:1;
      uint64_t OFF2:1;
      uint64_t OFF3:1;
      uint64_t OFF4:1;
      uint64_t OFF5:1;
      uint64_t OFF6:1;
      uint64_t OFF7:1;
      uint64_t OFF8:1;
      uint64_t OFF9:1;
      uint64_t OFF10:1;
      uint64_t OFF11:1;
      uint64_t OFF12:1;
      uint64_t OFF13:1;
      uint64_t OFF14:1;
      uint64_t OFF15:1;
      uint64_t DIFF0:1;
      uint64_t DIFF1:1;
      uint64_t DIFF2:1;
      uint64_t DIFF3:1;
      uint64_t DIFF4:1;
      uint64_t DIFF5:1;
      uint64_t DIFF6:1;
      uint64_t DIFF7:1;
      uint64_t DIFF8:1;
      uint64_t DIFF9:1;
      uint64_t DIFF10:1;
      uint64_t DIFF11:1;
      uint64_t DIFF12:1;
      uint64_t DIFF13:1;
      uint64_t DIFF14:1;
      uint64_t DIFF15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_COR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CDR_15;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t TSON:1;
      uint64_t reservedSpace1:3;
      uint64_t IBCTL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_ACR;

  uint8_t res3[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_WPSR;

  uint8_t res4[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_RPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_RCR;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_RNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_RNCR;

