iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3X8E/targetInit/SAM3X8Esfr.h
  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_PTSR;

};

#define ADC (*(volatile struct ADC_tag *) 0x400c0000)

struct DMAC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t ARB_CFG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_GCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSREQ0:1;
      uint64_t DSREQ0:1;
      uint64_t SSREQ1:1;
      uint64_t DSREQ1:1;
      uint64_t SSREQ2:1;
      uint64_t DSREQ2:1;
      uint64_t SSREQ3:1;
      uint64_t DSREQ3:1;
      uint64_t SSREQ4:1;
      uint64_t DSREQ4:1;
      uint64_t SSREQ5:1;
      uint64_t DSREQ5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_SREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCREQ0:1;
      uint64_t DCREQ0:1;
      uint64_t SCREQ1:1;
      uint64_t DCREQ1:1;
      uint64_t SCREQ2:1;
      uint64_t DCREQ2:1;
      uint64_t SCREQ3:1;
      uint64_t DCREQ3:1;
      uint64_t SCREQ4:1;
      uint64_t DCREQ4:1;
      uint64_t SCREQ5:1;
      uint64_t DCREQ5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLAST0:1;
      uint64_t DLAST0:1;
      uint64_t SLAST1:1;
      uint64_t DLAST1:1;
      uint64_t SLAST2:1;
      uint64_t DLAST2:1;
      uint64_t SLAST3:1;
      uint64_t DLAST3:1;
      uint64_t SLAST4:1;
      uint64_t DLAST4:1;
      uint64_t SLAST5:1;
      uint64_t DLAST5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_LAST;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t BTC4:1;
      uint64_t BTC5:1;
      uint64_t reservedSpace0:2;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t CBTC4:1;
      uint64_t CBTC5:1;
      uint64_t reservedSpace1:2;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
      uint64_t ERR4:1;
      uint64_t ERR5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_EBCIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t BTC4:1;
      uint64_t BTC5:1;
      uint64_t reservedSpace0:2;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t CBTC4:1;
      uint64_t CBTC5:1;
      uint64_t reservedSpace1:2;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
      uint64_t ERR4:1;
      uint64_t ERR5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_EBCIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t BTC4:1;
      uint64_t BTC5:1;
      uint64_t reservedSpace0:2;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t CBTC4:1;
      uint64_t CBTC5:1;
      uint64_t reservedSpace1:2;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
      uint64_t ERR4:1;
      uint64_t ERR5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_EBCIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t BTC4:1;
      uint64_t BTC5:1;
      uint64_t reservedSpace0:2;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t CBTC4:1;
      uint64_t CBTC5:1;
      uint64_t reservedSpace1:2;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
      uint64_t ERR4:1;
      uint64_t ERR5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_EBCISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA0:1;
      uint64_t ENA1:1;
      uint64_t ENA2:1;
      uint64_t ENA3:1;
      uint64_t ENA4:1;
      uint64_t ENA5:1;
      uint64_t reservedSpace0:2;
      uint64_t SUSP0:1;
      uint64_t SUSP1:1;
      uint64_t SUSP2:1;
      uint64_t SUSP3:1;
      uint64_t SUSP4:1;
      uint64_t SUSP5:1;
      uint64_t reservedSpace1:10;
      uint64_t KEEP0:1;
      uint64_t KEEP1:1;
      uint64_t KEEP2:1;
      uint64_t KEEP3:1;
      uint64_t KEEP4:1;
      uint64_t KEEP5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIS0:1;
      uint64_t DIS1:1;
      uint64_t DIS2:1;
      uint64_t DIS3:1;
      uint64_t DIS4:1;
      uint64_t DIS5:1;
      uint64_t reservedSpace0:2;
      uint64_t RES0:1;
      uint64_t RES1:1;
      uint64_t RES2:1;
      uint64_t RES3:1;
      uint64_t RES4:1;
      uint64_t RES5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA0:1;
      uint64_t ENA1:1;
      uint64_t ENA2:1;
      uint64_t ENA3:1;
      uint64_t ENA4:1;
      uint64_t ENA5:1;
      uint64_t reservedSpace0:2;
      uint64_t SUSP0:1;
      uint64_t SUSP1:1;
      uint64_t SUSP2:1;
      uint64_t SUSP3:1;
      uint64_t SUSP4:1;
      uint64_t SUSP5:1;
      uint64_t reservedSpace1:2;
      uint64_t EMPT0:1;
      uint64_t EMPT1:1;
      uint64_t EMPT2:1;
      uint64_t EMPT3:1;
      uint64_t EMPT4:1;
      uint64_t EMPT5:1;
      uint64_t reservedSpace2:2;
      uint64_t STAL0:1;
      uint64_t STAL1:1;
      uint64_t STAL2:1;
      uint64_t STAL3:1;
      uint64_t STAL4:1;
      uint64_t STAL5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CHSR;

